<details><summary>Digger run report at 2024-01-25 16:56:39 (UTC)</summary>
    <details><summary>Plan for <b>skysalomo/poc_digger#hello</b></summary>
  
```terraform
Terraform will perform the following actions:

  # local_file.tf will be created
  + resource "local_file" "tf" {
      + content              = "hello world test test test"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./test.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bye_world   = "bye world"
  + hello_world = "hello world"

─────────────────────────────────────────────────────────────────────────────
  ```
</details>

<details><summary>Terraform plan validation check (hello)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>